[
  {
    "title": "Dead Silence",
    "genre": "Horror, Supernatural",
    "year": 2007,
    "img": "images/horror/dead_silence(2007).jpg",
    "description": "After his wife is murdered under mysterious circumstances, Jamie Ashen returns to his hometown of Ravens Fair to investigate. He discovers the legend of Mary Shaw, a murderous ventriloquist whose apron of dolls and ventriloquist dummy Billy may be linked to his wife’s death. Silence (in more than one sense) may be the key to escaping Mary Shaw’s curse."
  },
  {
    "title": "Evil Dead Rise",
    "genre": "Horror, Supernatural",
    "year": 2023,
    "img": "images/horror/evil_dead_rise(2023).jpg",
    "description": "Two estranged sisters reunite in a cramped Los Angeles apartment building, only for a demonic threat to emerge. Discovery of an ancient book unleashes a plague of flesh‑possessing demons, forcing them and their family to fight for survival in a terrifying, blood‑soaked ordeal."
  },
  {
    "title": "Goodnight Mommy",
    "genre": "Horror, Psychological Thriller",
    "year": 2022,
    "img": "images/horror/goodnight_mommy(2022).jpg",
    "description": "Twin brothers Elias and Lukas return to their mothers home after her cosmetic surgery, only to find her behavior strange, her face full of bandages, and rules that feel off. They begin to suspect that the woman in their home may not be their real mother."
  },
  {
    "title": "Hereditary",
    "genre": "Horror, Drama, Supernatural",
    "year": 2018,
    "img": "images/horror/hereditary(2018).png",
    "description": "After the death of the family matriarch, a grieving family starts to unravel cryptic and terrifying secrets about their ancestry. Supernatural forces begin to encroach, and the very meaning of family and heritage becomes a horrifying curse."
  },
  {
    "title": "His House",
    "genre": "Horror, Thriller",
    "year": 2020,
    "img": "images/horror/his_house(2020).jpg",
    "description": "A refugee couple fleeing war in South Sudan resettle in a seemingly safe English town—but they carry unresolved guilt and secrets, and discover that their new house harbors a sinister presence linked to their past."
  },
  {
    "title": "I Am the Pretty Things That Lives in the House",
    "genre": "Horror, Gothic, Psychological",
    "year": 2016,
    "img": "images/horror/i_am_the_pretty_things_that_lives_in_the_house(2016).jpg",
    "description": "An elderly horror novelist living in a crumbling old estate believes she is haunted by a sinister presence from her past. When her new live‑in nurse begins to investigate strange sounds and phenomena, they uncover more than either bargained for."
  },
  {
    "title": "Insidious",
    "genre": "Supernatural Horror",
    "year": 2010,
    "img": "images/horror/insidious(2010).jpg",
    "description": "A familys son falls into a mysterious coma, and they begin experiencing terrifying paranormal disturbances. They seek help from paranormal experts, uncovering that the boy is trapped in a dark realm and that malevolent spirits want to keep him there."
  },
  {
    "title": "It",
    "genre": "Horror, Thriller, Supernatural",
    "year": 2017,
    "img": "images/horror/it(2017).jpg",
    "description": "When children begin disappearing in the town of Derry, a group of kids confront their fears and band together to face Pennywise, an ancient, shape‑shifting evil that emerges every 27 years."
  },
  {
    "title": "Jaws",
    "genre": "Horror, Thriller",
    "year": 1975,
    "img": "images/horror/jaws(1975).jpg",
    "description": "A giant, maneating great white shark terrorizes the quiet island community of Amity. A police chief, a marine biologist, and a hardened fisherman head out to sea in a battle to stop the predator before more lives are lost."
  },
  {
    "title": "Late Night with the Devil",
    "genre": "Horror, Supernatural",
    "year": 2023,
    "img": "images/horror/late_night_with_the_devil(2023).jpg",
    "description": "In 1977, the host of a latenight talk show goes missing during a live broadcast. Fearing a ratings collapse, the producers broadcast an episode filmed in secret—but it unleashes demonic forces and nightly terrors beyond their control."
  },
  {
    "title": "Sinister",
    "genre": "Horror, Supernatural, Thriller",
    "year": 2012,
    "img": "images/horror/sinister(2012).jpg",
    "description": "A truecrime writer discovers a box of home movies depicting brutal murders in his attic. As he investigates, he unwittingly summons a malevolent entity that threatens his family’s lives."
  },
  {
    "title": "Talk to Me",
    "genre": "Horror, Supernatural",
    "year": 2022,
    "img": "images/horror/talk_to_me(2022).jpg",
    "description": "A group of friends discover how to contact spirits using an embalmed hand. Their experiment becomes dangerous when the boundary between the living and dead becomes dangerously thin."
  },
  {
    "title": "The Conjuring",
    "genre": "Supernatural Horror",
    "year": 2013,
    "img": "images/horror/the_conjuring(2013).jpg",
    "description": "Paranormal investigators Ed and Lorraine Warren are called to help a family terrorized by a dark presence in their farmhouse. What they uncover is more horrifying than they ever imagined—a demon determined to destroy their family."
  },
  {
    "title": "The Deliverance",
    "genre": "Horror, Thriller",
    "year": 2024,
    "img": "images/horror/the_deliverance(2024).webp",
    "description": "A chilling tale (details yet to be fully disclosed) about captivity, dread, and what one will do to survive when pushed beyond their limits in the darkest situations."
  },
  {
    "title": "The Invitation",
    "genre": "Horror, Mystery",
    "year": 2022,
    "img": "images/horror/the_invitation(2022).jpg",
    "description": "When a group of friends accepts a dinner invitation to an old acquaintances home, they quickly realize that something very wrong is going on—old grudges, secrets, and sinister motives come to light."
  },
  {
    "title": "The Nun",
    "genre": "Supernatural Horror",
    "year": 2018,
    "img": "images/horror/the_nun(2018).jpg",
    "description": "From the Conjuring Universe: A priest and a novitiate are sent by the Vatican to investigate the suicide of a young nun in Romania. They discover the presence of a malevolent demonic nun and dark forces that threaten their faith and their lives."
  },
  {
    "title": "The Witch",
    "genre": "Horror, Supernatural, Period",
    "year": 2015,
    "img": "images/horror/the_witch(2015).png",
    "description": "In 1630s New England, a familys faith, unity, and sanity are tested when they are cast out of their settlement and forced to live at the edge of a dark forest. Strange incidents and sinister folklore converge on them, slowly consuming them from within."
  },
  {
    "title": "Until Dawn",
    "genre": "Horror, Thriller, Slasher",
    "year": 2015,
    "img": "images/horror/until_dawn(2015).jpg",
    "description": "A group of friends stay at a remote mountain lodge until sunrise—but as tensions, secrets, and danger mount, they realize they are being stalked by a killer, and one by one, must try to survive the night."
  },
  {
    "title": "Vampires & Bronx",
    "genre": "Horror, Comedy",
    "year": 2020,
    "img": "images/horror/vampires_and_bronx(2020).jpg",
    "description": "When ordinary, workingclass folks in the Bronx begin disappearing, the community suspects something supernatural. A reluctant duo must face vampires terrorizing the neighborhood and save their streets from fear."
  },
  {
    "title": "Veronica",
    "genre": "Horror, Supernatural",
    "year": 2017,
    "img": "images/horror/veronica(2017).jpg",
    "description": "Based on a true story: after using a Ouija board with friends, a teenage girl named Veronica unintentionally invites a sinister and powerful supernatural force into her home—leading to terror and tragedy."
  }
]
